{
  "model_type": "gpt2",
  "architectures": [
    "GPT2LMHeadModel"
  ],
  "activation_function": "gelu",
  "attn_pdrop": 0.1,
  "embd_pdrop": 0.1,
  "resid_pdrop": 0.1,
  "initializer_range": 0.02,
  "layer_norm_epsilon": 1e-05,
  "n_embd": 512,
  "n_inner": 2048,
  "n_head": 8,
  "n_layer": 4,
  "vocab_size": 1,
  "n_ctx": 512,
  "n_positions": 512
}
